x1 <- c(9, 12, 17, 25, 7, 23, 27, 16, 15, 3, 5, 20, 13, 8, 18, 28, 11, 24, 6, 30, 10, 21, 29, 2, 14)
x2 <- c(7, 12, 11, 7, 14, 14, 7, 13, 10, 10, 10, 8, 12, 7, 9, 13, 14, 8, 10, 6, 11, 9, 13, 7, 9)
y <- c(26.42, 39.44, 46.57, 52.09, 34.85, 60.54, 56.56, 48.81, 40.36, 23.46, 24.68, 45.53, 40.63, 26.02, 
       45.08, 66.78, 40.16, 52.47, 28.26, 60.02, 34.42, 48.83, 68.50, 14.41, 37.98)

X <- as.matrix(cbind(1, x1, x2))      # x값의 행렬
y <- as.matrix(y)                     # y 값 입력

alpha <- 0.7                          # 주어진 alpha 값
num_iters <- 5000                     # 주어진 반복횟수
w <- matrix(c(rep(0, 3)), nrow=3)     # 주어진 w 초기값
h <- matrix(c(rep(0, 3)), nrow=3)     # 주어진 h 초기값

for (i in 1:num_iters) {
  error <- (X %*% w - y) / length(y)             
  delta <- t(X) %*% error             # 기존 경사하강법
  
  h <- h + delta * delta              # w 미분 계수 행렬의 원소 곱을 h에 반영
  w <- w - (alpha * (1 / sqrt(h)) ) * delta # 반영한 h와 alpha의 곱, alpha 값이 유동적으로 변함.
}

w
